In [1]:
import pandas as pd
import numpy as np

s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [2]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [3]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [4]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [5]:
#dataFrame數學運算時同時對齊row和columns標籤
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)),
                  columns=list('bcd'),
                  index=['台北','台中','台南'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                  columns = list('bde'),
                  index=['高雄','台北','台中','台南'])

In [6]:
df1

      b    c    d
台北  0.0  1.0  2.0
台中  3.0  4.0  5.0
台南  6.0  7.0  8.0

In [7]:
df2

      b     d     e
高雄  0.0   1.0   2.0
台北  3.0   4.0   5.0
台中  6.0   7.0   8.0
台南  9.0  10.0  11.0

In [8]:
df1 + df2

       b   c     d   e
台中   9.0 NaN  12.0 NaN
台北   3.0 NaN   6.0 NaN
台南  15.0 NaN  18.0 NaN
高雄   NaN NaN   NaN NaN

In [9]:
#相同row,不同的column標籤對齊
df1 = pd.DataFrame({'A':[1, 2]})
df2 = pd.DataFrame({'B':[3, 4]})
df1

   A
0  1
1  2

In [10]:
df2

   B
0  3
1  4

In [11]:
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

In [12]:
#add()方法配合fill_value引數名稱
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                  columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                  columns=list('abcde'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [13]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [15]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [22]:
frame = pd.DataFrame(np.random.randn(4,3),
                    columns=['第一天','第二天','第三天'],
                    index=['台北','台中','台南','高雄'])
frame

         第一天       第二天       第三天
台北 -0.662532  1.387006 -2.596028
台中 -1.473327  1.360404 -0.377587
台南  0.014400 -0.547491  0.528455
高雄  0.983595  0.920368  0.325684

In [23]:
frame * 3

         第一天       第二天       第三天
台北 -1.987596  4.161019 -7.788085
台中 -4.419980  4.081211 -1.132762
台南  0.043199 -1.642473  1.585365
高雄  2.950785  2.761103  0.977051

In [24]:
np.abs(frame)

         第一天       第二天       第三天
台北  0.662532  1.387006  2.596028
台中  1.473327  1.360404  0.377587
台南  0.014400  0.547491  0.528455
高雄  0.983595  0.920368  0.325684

In [25]:
def abc(se):
    return se.max() - se.min()
frame.apply(abc)

第一天    2.456922
第二天    1.934497
第三天    3.124483
dtype: float64

In [26]:
frame.apply(abc, axis=0)

第一天    2.456922
第二天    1.934497
第三天    3.124483
dtype: float64

In [27]:
frame.apply(abc, axis=1)

台北    3.983035
台中    2.833730
台南    1.075946
高雄    0.657911
dtype: float64

In [28]:
frame.apply(lambda se: se.max() - se.min())

第一天    2.456922
第二天    1.934497
第三天    3.124483
dtype: float64

In [29]:
frame.apply(lambda se: se.max() - se.min(),axis=1)

台北    3.983035
台中    2.833730
台南    1.075946
高雄    0.657911
dtype: float64

In [31]:
def f(x):
    return pd.Series([x.min(),x.max()],index=['min','max'])
frame.apply(f,axis=0)

          第一天       第二天       第三天
min -1.473327 -0.547491 -2.596028
max  0.983595  1.387006  0.528455

In [34]:
dataFrame = frame.apply(f,axis=1)

In [35]:
dataFrame.T

           台北        台中        台南        高雄
min -2.596028 -1.473327 -0.547491  0.325684
max  1.387006  1.360404  0.528455  0.983595

In [36]:
frame

         第一天       第二天       第三天
台北 -0.662532  1.387006 -2.596028
台中 -1.473327  1.360404 -0.377587
台南  0.014400 -0.547491  0.528455
高雄  0.983595  0.920368  0.325684

In [37]:
def format(x):
    return '{:.2f}'.format(x)
frame.applymap(format)

      第一天    第二天    第三天
台北  -0.66   1.39  -2.60
台中  -1.47   1.36  -0.38
台南   0.01  -0.55   0.53
高雄   0.98   0.92   0.33

In [39]:
frame['第一天'].map(format)

台北    -0.66
台中    -1.47
台南     0.01
高雄     0.98
Name: 第一天, dtype: object